[Killed] BlockStatement
commentController.js:2:17
 class CommentController {
-  constructor() {
-    this.comments = [];
-  }
+  constructor() {}
 
   submitComment(text, securityRating) {
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
commentController.js:3:21
 class CommentController {
   constructor() {
-    this.comments = [];
+    this.comments = ["Stryker was here"];
   }
 
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
commentController.js:7:9
   }
 
   submitComment(text, securityRating) {
-    if (typeof text !== 'string') {
+    if (false) {
       throw new Error('Invalid text: must be a string');
     }
killedBy: CommentController submitComment should throw if text is not a string (null)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid text: must be a string"
Received message:   "Cannot read properties of null (reading 'length')"

      68 |         }
      69 |       }

[Killed] ConditionalExpression
commentController.js:7:9
   }
 
   submitComment(text, securityRating) {
-    if (typeof text !== 'string') {
+    if (true) {
       throw new Error('Invalid text: must be a string');
     }
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: Invalid text: must be a string

[Killed] EqualityOperator
commentController.js:11:9
       throw new Error('Invalid text: must be a string');
     }
 
-    if (text.length < 3 || text.length > 300) {
+    if (text.length >= 3 || text.length > 300) {
       throw new Error('Invalid text length: must be between 3 and 300 characters');
     }
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: Invalid text length: must be between 3 and 300 characters

[Killed] ConditionalExpression
commentController.js:11:9
       throw new Error('Invalid text: must be a string');
     }
 
-    if (text.length < 3 || text.length > 300) {
+    if (false) {
       throw new Error('Invalid text length: must be between 3 and 300 characters');
     }
killedBy: CommentController submitComment should throw if text is too short (< 3)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid text length: must be between 3 and 300 characters"

Received function did not throw

[Killed] Regex
commentController.js:16:29
     }
 
     // Prohibited characters: ", ', ; . ( ) % and space
-    const prohibitedChars = /[",';. ()%]/;
+    const prohibitedChars = /[^",';. ()%]/;
     if (prohibitedChars.test(text)) {
       throw new Error('Invalid text: contains prohibited characters');
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: Invalid text: contains prohibited characters

[Killed] BlockStatement
commentController.js:17:37
 
     // Prohibited characters: ", ', ; . ( ) % and space
     const prohibitedChars = /[",';. ()%]/;
-    if (prohibitedChars.test(text)) {
-      throw new Error('Invalid text: contains prohibited characters');
-    }
+    if (prohibitedChars.test(text)) {}
 
     if (!Number.isInteger(securityRating)) {
killedBy: CommentController submitComment should throw if text contains prohibited character: "
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid text: contains prohibited characters"

Received function did not throw

[Killed] ConditionalExpression
commentController.js:17:9
 
     // Prohibited characters: ", ', ; . ( ) % and space
     const prohibitedChars = /[",';. ()%]/;
-    if (prohibitedChars.test(text)) {
+    if (false) {
       throw new Error('Invalid text: contains prohibited characters');
     }
killedBy: CommentController submitComment should throw if text contains prohibited character: "
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid text: contains prohibited characters"

Received function did not throw

[Killed] ConditionalExpression
commentController.js:21:9
       throw new Error('Invalid text: contains prohibited characters');
     }
 
-    if (!Number.isInteger(securityRating)) {
+    if (true) {
       throw new Error('Invalid security rating: must be an integer');
     }
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: Invalid security rating: must be an integer

[Killed] ConditionalExpression
commentController.js:21:9
       throw new Error('Invalid text: contains prohibited characters');
     }
 
-    if (!Number.isInteger(securityRating)) {
+    if (false) {
       throw new Error('Invalid security rating: must be an integer');
     }
killedBy: CommentController submitComment should throw if security rating is not a number
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid security rating: must be an integer"

Received function did not throw

[Killed] LogicalOperator
commentController.js:25:9
       throw new Error('Invalid security rating: must be an integer');
     }
 
-    if (securityRating < 1 || securityRating > 10) {
+    if (securityRating < 1 && securityRating > 10) {
       throw new Error('Invalid security rating: must be between 1 and 10');
     }
killedBy: CommentController submitComment should throw if security rating is < 1
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid security rating: must be between 1 and 10"

Received function did not throw

[Killed] EqualityOperator
commentController.js:25:31
       throw new Error('Invalid security rating: must be an integer');
     }
 
-    if (securityRating < 1 || securityRating > 10) {
+    if (securityRating < 1 || securityRating >= 10) {
       throw new Error('Invalid security rating: must be between 1 and 10');
     }
killedBy: CommentController submitComment should save a comment with maximum valid rating (10)
statusReason: Error: Invalid security rating: must be between 1 and 10

[Killed] BooleanLiteral
commentController.js:36:23
     };
 
     this.comments.push(comment);
-    return { success: true, comment };
+    return { success: false, comment };
   }
 }
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
commentController.js:36:12
     };
 
     this.comments.push(comment);
-    return { success: true, comment };
+    return {};
   }
 }
killedBy: CommentController submitComment should successfully save a valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
